dhimasardinata/esp8266-sensor-node/lib/GreenhouseCommon/ApiClient.Transport.cpp
#include "ApiClient.h"

#include <ESP8266HTTPClient.h>
#include <ESP8266WiFi.h>
#include <ESPAsyncWebServer.h>
#include <WiFiClientSecureBearSSL.h>
#include <bearssl/bearssl_hmac.h>
#include <user_interface.h>

#include <algorithm>
#include <cstring>
#include <strings.h>

#include "CacheManager.h"  // Concrete type for CRTP
#include "CompileTimeJSON.h"
#include "ConfigManager.h"
#include "CryptoUtils.h"
#include "Logger.h"
#include "NtpClient.h"
#include "RtcManager.h"
#include "SensorManager.h"  // Concrete type for CRTP
#include "REDACTED"
#include "constants.h"
#include "node_config.h"
#include "sensor_data.h"
#include "utils.h"

// ApiClient.Transport.cpp - HTTP transport and state machine

#ifndef FACTORY_OTA_TOKEN
#define FACTORY_OTA_TOKEN "REDACTED"
#endif

namespace {
  static constexpr size_t kMaxDynamicTokenLen = REDACTED
  static constexpr size_t kBearerHeaderBufferLen = 192;
  static constexpr char kTaAtomicHost[] = "ta.example.com";

  struct EdgeGatewayTargets {
    const char* primaryMdns;
    const char* primaryIp;
    const char* secondaryMdns;
    const char* secondaryIp;
  };

  inline bool prefersGatewayGh1() {
    if (GH_ID == 1) {
      return NODE_ID <= 5;
    }
    if (GH_ID == 2) {
      return false;
    }
    return NODE_ID <= 5;
  }

  inline EdgeGatewayTargets resolveEdgeGatewayTargets() {
    static constexpr char kGatewayGh1[] = "gateway-gh-1.local";
    static constexpr char kGatewayGh2[] = "gateway-gh-2.local";
    const bool preferGh1 = prefersGatewayGh1();

    const char* primaryMdns = preferGh1 ? kGatewayGh1 : kGatewayGh2;
    const char* secondaryMdns = preferGh1 ? kGatewayGh2 : kGatewayGh1;
    const char* primaryIp = preferGh1 ? DEFAULT_GATEWAY_IP_GH1 : DEFAULT_GATEWAY_IP_GH2;
    const char* secondaryIp = preferGh1 ? DEFAULT_GATEWAY_IP_GH2 : DEFAULT_GATEWAY_IP_GH1;
    return {primaryMdns, primaryIp, secondaryMdns, secondaryIp};
  }

  inline void build_bearer(char* out, size_t out_len, const char* token, size_t token_len) {
    if (!out || out_len == 0) {
      return;
    }
    static constexpr char kPrefix[] = "Bearer ";
    constexpr size_t kPrefixLen = sizeof(kPrefix) - 1;
    size_t n = (token_len < (out_len - 1 - kPrefixLen)) ? token_len : (out_len - 1 - kPrefixLen);
    memcpy(out, kPrefix, kPrefixLen);
    if (n > 0) {
      memcpy(out + kPrefixLen, token, n);
    }
    out[kPrefixLen + n] = '\0';
  }

  inline void copy_trunc(char* dst, size_t dst_len, const char* src, size_t src_len) {
    if (!dst || dst_len == 0) {
      return;
    }
    size_t n = (src_len < (dst_len - 1)) ? src_len : (dst_len - 1);
    if (n > 0) {
      memcpy(dst, src, n);
    }
    dst[n] = '\0';
  }

  inline void copy_trunc(char* dst, size_t dst_len, const char* src) {
    if (!dst || dst_len == 0 || !src) {
      return;
    }
    size_t n = strnlen(src, dst_len - 1);
    if (n > 0) {
      memcpy(dst, src, n);
    }
    dst[n] = '\0';
  }

  inline bool host_matches_domain(const char* host, const char* domain) {
    if (!host || !domain || host[0] == '\0' || domain[0] == '\0') {
      return false;
    }
    const char* end = host;
    while (*end != '\0' && *end != ':' && *end != '/' && *end != '?' && *end != '#') {
      ++end;
    }
    const size_t host_len = static_cast<size_t>(end - host);
    const size_t domain_len = strlen(domain);
    return host_len == domain_len && strncasecmp(host, domain, domain_len) == 0;
  }

  inline const char* select_token_for_host(ConfigManager& configManager, const char* host) {
    if (host_matches_domain(host, kTaAtomicHost) && FACTORY_OTA_TOKEN[0] != REDACTED
      return FACTORY_OTA_TOKEN;
    }
    return configManager.getAuthToken();
  }

  inline bool build_auth_header_for_host(char* out, size_t out_len, ConfigManager& configManager, const char* host) {
    if (!out || out_len == 0) {
      return false;
    }
    const char* token = REDACTED
    const size_t token_len = REDACTED
    if (token_len =REDACTED
      out[0] = '\0';
      return false;
    }
    build_bearer(out, out_len, token, token_len);
    return true;
  }

  inline size_t append_literal(char* out, size_t out_len, size_t pos, const char* text);
  inline size_t append_i32(char* out, size_t out_len, size_t pos, int32_t value);

  void resolveCloudTarget(const char* url, char* host, size_t host_len, char* path, size_t path_len) {
    if (host && host_len > 0)
      host[0] = '\0';
    if (path && path_len > 0)
      path[0] = '\0';

    if (!url || url[0] == '\0') {
      if (host && host_len > 0) {
        copy_trunc(host, host_len, "example.com", sizeof("example.com") - 1);
      }
      if (path && path_len > 0) {
        copy_trunc(path, path_len, "/api/sensor", sizeof("/api/sensor") - 1);
      }
      return;
    }

    const char* p = url;
    if (strncmp(p, "https://", 8) == 0) {
      p += 8;
    } else if (strncmp(p, "http://", 7) == 0) {
      p += 7;
    }

    const char* slash = strchr(p, '/');
    if (host && host_len > 0) {
      size_t len = slash ? static_cast<size_t>(slash - p) : strnlen(p, host_len - 1);
      len = std::min(len, host_len - 1);
      if (len > 0) {
        copy_trunc(host, host_len, p, len);
      } else {
        copy_trunc(host, host_len, "example.com", sizeof("example.com") - 1);
      }
    }

    if (path && path_len > 0) {
      if (slash) {
        copy_trunc(path, path_len, slash);
      } else {
        copy_trunc(path, path_len, "/api/sensor", sizeof("/api/sensor") - 1);
      }
    }
  }

  bool read_line(WiFiClient& client, char* out, size_t out_len, unsigned long timeoutMs) {
    if (!out || out_len == 0)
      return false;
    size_t pos = 0;
    unsigned long start = millis();
    while (millis() - start < timeoutMs) {
      while (client.available()) {
        char c = static_cast<char>(client.read());
        if (c == '\r')
          continue;
        if (c == '\n') {
          out[pos] = '\0';
          return true;
        }
        if (pos + 1 < out_len) {
          out[pos++] = c;
        }
      }
      if (!client.connected() && !client.available()) {
        break;
      }
      yield();
    }
    out[pos] = '\0';
    return pos > 0;
  }

  int parse_status_code(const char* line) {
    if (!line)
      return -1;
    const char* p = strchr(line, ' ');
    if (!p)
      return -1;
    while (*p == ' ')
      ++p;
    int code = 0;
    int digits = 0;
    while (*p >= '0' && *p <= '9') {
      code = (code * 10) + (*p - '0');
      ++p;
      ++digits;
      if (digits >= 3)
        break;
    }
    return (digits >= 3) ? code : -1;
  }

  const char* lookup_http_reason(int code) {
    static constexpr struct {
      int code;
      const char* reason;
    } httpErrors[] = {{301, "Moved Permanently"},
                      {302, "Redirect"},
                      {303, "See Other"},
                      {307, "Temp Redirect"},
                      {308, "Perm Redirect"},
                      {400, "Bad Request"},
                      {401, "REDACTED"},
                      {403, "Forbidden"},
                      {404, "Not Found"},
                      {419, "Session Expired"},
                      {422, "Unprocessable"},
                      {429, "Too Many Requests"},
                      {500, "Server Error"}};
    for (const auto& err : httpErrors) {
      if (code == err.code) {
        return err.reason;
      }
    }
    return "Error";
  }

  void buildErrorMessageSimple(UploadResult& result) {
    if (result.success) {
      copy_trunc(result.message, sizeof(result.message), "OK", 2);
      return;
    }
    if (result.httpCode < 0) {
      result.message[0] = '\0';
      size_t pos = 0;
      pos = append_literal(result.message, sizeof(result.message), pos, "HTTP error ");
      pos = append_i32(result.message, sizeof(result.message), pos, result.httpCode);
      return;
    }
    const char* reason = lookup_http_reason(result.httpCode);
    copy_trunc(result.message, sizeof(result.message), reason);
  }

