dhimasardinata/esp8266-sensor-node/lib/GreenhouseCommon/ApiClient.Transport.cpp
  bool readHeaderValue(HTTPClient& http, const char* name, char* out, size_t out_len) {
    if (!out || out_len == 0)
      return false;
    out[0] = '\0';
    String headerValue = http.header(name);
    if (headerValue.length() == 0) {
      return false;
    }
    headerValue.toCharArray(out, out_len);
    return true;
  }

  inline size_t append_literal(char* out, size_t out_len, size_t pos, const char* text) {
    if (!out || pos >= out_len || !text)
      return pos;
    size_t remaining = out_len - pos;
    if (remaining <= 1)
      return pos;
    size_t n = strnlen(text, remaining - 1);
    memcpy(out + pos, text, n);
    pos += n;
    out[pos] = '\0';
    return pos;
  }

  inline size_t u32_to_dec(char* out, size_t out_len, uint32_t value) {
    if (!out || out_len == 0)
      return 0;
    char tmp[10];
    size_t n = 0;
    do {
      tmp[n++] = static_cast<char>('0' + (value % 10));
      value /= 10;
    } while (value != 0 && n < sizeof(tmp));
    size_t written = 0;
    while (n > 0 && written + 1 < out_len) {
      out[written++] = tmp[--n];
    }
    out[written] = '\0';
    return written;
  }

  inline size_t append_u32(char* out, size_t out_len, size_t pos, uint32_t value) {
    if (!out || pos >= out_len)
      return pos;
    size_t remaining = out_len - pos;
    if (remaining <= 1)
      return pos;
    size_t n = u32_to_dec(out + pos, remaining, value);
    pos += n;
    if (pos < out_len)
      out[pos] = '\0';
    return pos;
  }

  inline size_t append_i32(char* out, size_t out_len, size_t pos, int32_t value) {
    if (value < 0) {
      pos = append_literal(out, out_len, pos, "-");
      value = -value;
    }
    return append_u32(out, out_len, pos, static_cast<uint32_t>(value));
  }
// Keep STR macros available for later use in this translation unit.
}  // namespace

void ApiClient::tryNtpFallbackProbe() {
  // Proactively probe HTTP server for time if NTP is unresponsive > 60s.
  if (millis() > 60000 && millis() - m_lastTimeProbe > 60000) {
    m_lastTimeProbe = millis();
    LOG_WARN("TIME", F("NTP stuck. Probing HTTP server for 'Date' header..."));

    (void)performSingleUpload("{}", 2, true);
  }
}


void ApiClient::setupHttpHeaders(HTTPClient& http, const AppConfig& cfg) {
  (void)cfg;
  http.setTimeout(15000);
  http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
  http.addHeader(F("Connection"), F("close"));
  http.addHeader(F("Accept"), F("application/json"));
  http.addHeader(F("Content-Type"), F("application/json"));
  http.addHeader(F("User-Agent"),
                 F("Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) "
                   "Chrome/120.0.0.0 Safari/537.36"));

  if (m_cloudHost[0] == '\0') {
    updateCloudTargetCache();
  }

  char authBuffer[kBearerHeaderBufferLen];
  if (build_auth_header_for_host(authBuffer, sizeof(authBuffer), m_configManager, m_cloudHost)) {
    http.addHeader(F("REDACTED"), authBuffer);
  }
}

void ApiClient::updateCloudTargetCache() {
  const char* url = m_configManager.getDataUploadUrl();
  resolveCloudTarget(url, m_cloudHost, sizeof(m_cloudHost), m_cloudPath, sizeof(m_cloudPath));
  m_configManager.releaseStrings();
}


void ApiClient::extractTimeFromResponse(HTTPClient& http) {
  if (m_ntpClient.isTimeSynced())
    return;

  char dateBuf[64] = {0};
  if (readHeaderValue(http, "Date", dateBuf, sizeof(dateBuf))) {
    time_t serverTime = Utils::parse_http_date(dateBuf);
    if (serverTime > 0) {
      m_ntpClient.setManualTime(serverTime);
    }
  }
}


void ApiClient::buildErrorMessage(UploadResult& result, HTTPClient& http) {
  if (result.success) {
    copy_trunc(result.message, sizeof(result.message), "OK", 2);
    return;
  }

  if (result.httpCode < 0) {
    result.message[0] = '\0';
    size_t pos = 0;
    pos = append_literal(result.message, sizeof(result.message), pos, "HTTP error ");
    pos = append_i32(result.message, sizeof(result.message), pos, result.httpCode);
    return;
  }

  // Error code lookup table - includes redirects and common errors
  static constexpr struct {
    int code;
    const char* reason;
  } httpErrors[] = {{301, "Moved Permanently"},
                    {302, "Redirect"},
                    {303, "See Other"},
                    {307, "Temp Redirect"},
                    {308, "Perm Redirect"},
                    {400, "Bad Request"},
                    {401, "REDACTED"},
                    {403, "Forbidden"},
                    {404, "Not Found"},
                    {419, "Session Expired"},
                    {422, "Unprocessable"},
                    {429, "Too Many Requests"},
                    {500, "Server Error"}};

  const char* reason = "Error";
  for (const auto& err : httpErrors) {
    if (result.httpCode == err.code) {
      reason = err.reason;
      break;
    }
  }

  // For redirects, try to show the Location header
  if (result.httpCode >= 300 && result.httpCode < 400) {
    char locBuf[64] = {0};
    if (readHeaderValue(http, "Location", locBuf, sizeof(locBuf))) {
      char display[24];
      size_t len = strnlen(locBuf, sizeof(locBuf));
      if (len > 20) {
        memcpy(display, locBuf, 17);
        memcpy(display + 17, "...", 3);
        display[20] = '\0';
      } else {
        copy_trunc(display, sizeof(display), locBuf, len);
      }
      result.message[0] = '\0';
      size_t pos = 0;
      pos = append_literal(result.message, sizeof(result.message), pos, reason);
      pos = append_literal(result.message, sizeof(result.message), pos, "->");
      pos = append_literal(result.message, sizeof(result.message), pos, display);
      return;
    }
  }

  result.message[0] = '\0';
  size_t pos = 0;
  pos = append_literal(result.message, sizeof(result.message), pos, "HTTP ");
  pos = append_i32(result.message, sizeof(result.message), pos, result.httpCode);
  pos = append_literal(result.message, sizeof(result.message), pos, " (");
  pos = append_literal(result.message, sizeof(result.message), pos, reason);
  pos = append_literal(result.message, sizeof(result.message), pos, ")");
}

