dhimasardinata/esp8266-sensor-node/lib/GreenhouseCommon/ApiClient.Transport.cpp
// =============================================================================
// Local Gateway Fallback Methods
// =============================================================================


void ApiClient::signPayload(const char* payload, size_t payload_len, char* signatureBuffer) {
  br_hmac_key_context kc;
  br_hmac_context ctx;

  const char* token = REDACTED
  const size_t token_len = REDACTED
  if (token_len =REDACTED
    if (signatureBuffer) {
      signatureBuffer[0] = '\0';
    }
    LOG_ERROR("REDACTED", F("REDACTED"));
    return;
  }
  if (!payload || payload_len == 0) {
    if (signatureBuffer) {
      signatureBuffer[0] = '\0';
    }
    LOG_ERROR("API", F("Payload empty; cannot sign"));
    return;
  }

  // Initialize HMAC with SHA256 using AUTH_TOKEN as key
  br_hmac_key_init(&kc, &br_sha256_vtable, token, token_len);
  br_hmac_init(&ctx, &kc, 0);

  // Process payload
  br_hmac_update(&ctx, payload, payload_len);

  // Output
  uint8_t digest[32];
  br_hmac_out(&ctx, digest);

  // Hex encode (no sprintf)
  static const char hex[] = "0123456789abcdef";
  for (int i = 0; i < 32; i++) {
    signatureBuffer[i * 2] = hex[(digest[i] >> 4) & 0x0F];
    signatureBuffer[i * 2 + 1] = hex[digest[i] & 0x0F];
  }
  signatureBuffer[64] = '\0';
}

// Dead code (performLocalGatewayUpload) removed


bool ApiClient::executeQosSample(HTTPClient& http,
                                 const char* url,
                                 const char* method,
                                 const char* payload,
                                 const AppConfig& cfg,
                                 unsigned long& duration) {
  ESP.wdtFeed();
  yield();

  unsigned long startTick = millis();
  int httpCode = -1;

  if (!acquireTlsResources(cfg.ALLOW_INSECURE_HTTPS())) {
    duration = millis() - startTick;
    return false;
  }

  if (http.begin(m_secureClient, url)) {
    char host[48] = {0};
    char path[8] = {0};
    resolveCloudTarget(url, host, sizeof(host), path, sizeof(path));

    char authBuf[kBearerHeaderBufferLen];
    if (build_auth_header_for_host(authBuf, sizeof(authBuf), m_configManager, host)) {
      http.addHeader(F("REDACTED"), authBuf);
    }
    http.addHeader(F("User-Agent"), F("ESP8266-Node/QoS"));

    if (strcmp(method, "POST") == 0) {
      http.addHeader(F("Content-Type"), F("application/json"));
      httpCode = http.POST(payload);
    } else {
      httpCode = http.GET();
    }
    http.end();
  }

  releaseTlsResources();
  duration = millis() - startTick;
  return (httpCode > 0);
}


void ApiClient::updateResult(int code, bool success, const char* msg) {
  m_lastResult.httpCode = code;
  m_lastResult.success = success;
  copy_trunc(m_lastResult.message, sizeof(m_lastResult.message), msg);
}


void ApiClient::transitionState(HttpState newState) {
  m_httpState = newState;
  m_stateEntryTime = millis();
}


void ApiClient::startUpload(const char* payload, size_t length, bool isEdgeTarget) {
  if (m_httpState != HttpState::IDLE) {
    LOG_WARN("API", F("Upload request ignored - Busy"));
    return;
  }

  m_payloadLen = length;
  m_targetIsEdge = isEdgeTarget;  // Store decision for State Machine
  // Payload is already in m_sharedBuffer

  transitionState(HttpState::CONNECTING);
}

// FIXED: Removed stack-based host pointer logic flaw.
// FIXED: Cleaned up messy connection logic.
// =============================================================================
// State Machine Handlers
// =============================================================================


void ApiClient::handleStateConnecting(const AppConfig& cfg) {
  bool isEdge = m_targetIsEdge;

  const char* host = nullptr;
  EdgeGatewayTargets edgeTargets = {nullptr, nullptr, nullptr, nullptr};
  uint16_t port = 0;
  m_edgeHost[0] = '\0';

  if (isEdge) {
    edgeTargets = resolveEdgeGatewayTargets();
    host = edgeTargets.primaryMdns;
    port = 80;
    m_activeClient = &m_plainClient;
  } else {
    if (m_cloudHost[0] == '\0') {
      updateCloudTargetCache();
    }
    host = m_cloudHost;
    port = 443;
    m_activeClient = &m_secureClient;
  }

  broadcastUploadTarget(isEdge);

  if (!isEdge) {
    if (!acquireTlsResources(cfg.ALLOW_INSECURE_HTTPS())) {
      updateResult(HTTPC_ERROR_TOO_LESS_RAM, false, "Low TLS heap");
      transitionState(HttpState::FAILED);
      return;
    }
    const uint32_t maxBlock = ESP.getMaxFreeBlockSize();
    const uint32_t totalFree = REDACTED
    uint32_t minBlock = AppConstants::TLS_MIN_SAFE_BLOCK_SIZE;
    uint32_t minTotal = REDACTED
    if (m_ws.count() > 0) {
      minBlock += 512;
      minTotal += REDACTED
    }
    if (maxBlock < minBlock || totalFree < minTotal) {
      updateResult(HTTPC_ERROR_TOO_LESS_RAM, false, "Low TLS heap");
      transitionState(HttpState::FAILED);
      return;
    }
  }
  m_activeClient->setTimeout(5000);
  yield();
  LOG_INFO("API", F("TLS pre-connect heap: %u, blk: %u"), ESP.getFreeHeap(), ESP.getMaxFreeBlockSize());
  bool connected = false;
  if (isEdge) {
    const char* candidates[] = {
        edgeTargets.primaryMdns,
        edgeTargets.primaryIp,
        edgeTargets.secondaryMdns,
        edgeTargets.secondaryIp,
    };
    const char* labels[] = {
        "mDNS primary",
        "static primary",
        "mDNS secondary",
        "static secondary",
    };

    for (size_t i = 0; i < (sizeof(candidates) / sizeof(candidates[0])) && !connected; ++i) {
      const char* candidate = candidates[i];
      if (!candidate || candidate[0] == '\0') {
        continue;
      }

      bool duplicate = false;
      for (size_t j = 0; j < i; ++j) {
        const char* prev = candidates[j];
        if (prev && strcmp(prev, candidate) == 0) {
          duplicate = true;
          break;
        }
      }
      if (duplicate) {
        continue;
      }

      if (i > 0) {
        LOG_WARN("API", F("Edge fallback -> %s"), labels[i]);
      }
      connected = m_activeClient->connect(candidate, port);
      if (connected) {
        host = candidate;
      }
    }

    if (!connected) {
      LOG_WARN("API", F("Edge gateways unreachable; trying cloud fallback"));
    }
  } else {
    connected = m_activeClient->connect(host, port);
  }

  if (connected) {
    if (isEdge) {
      copy_trunc(m_edgeHost, sizeof(m_edgeHost), host);
    }
    transitionState(HttpState::SENDING_REQUEST);
  } else {
    updateResult(HTTPC_ERROR_CONNECTION_FAILED, false, "Connect Failed");
    transitionState(HttpState::FAILED);
  }
}


