dhimasardinata/esp8266-sensor-node/lib/GreenhouseCommon/ApiClient.Transport.cpp
void ApiClient::handleStateSending(const AppConfig& cfg) {
  if (!m_activeClient || !m_activeClient->connected()) {
    updateResult(HTTPC_ERROR_CONNECTION_LOST, false, "Disconnected");
    transitionState(HttpState::FAILED);
    return;
  }
  char* buf = sharedBuffer();
  if (!buf) {
    updateResult(HTTPC_ERROR_CONNECTION_LOST, false, "No payload buffer");
    transitionState(HttpState::FAILED);
    return;
  }

  // Construct Headers - STREAMING MODE (No String/Heap allocation)
  if (!m_targetIsEdge && (m_cloudHost[0] == '\0' || m_cloudPath[0] == '\0')) {
    updateCloudTargetCache();
  }

  const char* path = m_targetIsEdge ? "/api/data" : m_cloudPath;
  EdgeGatewayTargets edgeTargets = resolveEdgeGatewayTargets();
  const char* host = m_targetIsEdge
                         ? ((m_edgeHost[0] != '\0')
                                ? m_edgeHost
                                : edgeTargets.primaryMdns)
                         : m_cloudHost;

  // 1) Request line + Host + Common headers (grouped to reduce print calls)
  m_activeClient->print(F("POST "));
  m_activeClient->print(path);
  m_activeClient->print(F(" HTTP/1.1\r\nHost: "));
  m_activeClient->print(host);
  m_activeClient->print(
      F("\r\nConnection: close\r\n"
        "Content-Type: application/json\r\n"
        "Accept: application/json\r\n"
        "User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) ESP8266/Node\r\n"
        "Content-Length: "));
  m_activeClient->print(m_payloadLen);
  m_activeClient->print(F("\r\n"));

  // 4. Mode-Specific Headers
  if (m_targetIsEdge) {
    m_activeClient->print(F("X-Node-ID: "));
    m_activeClient->print(NODE_ID);
    m_activeClient->print(F("\r\n"));

    m_activeClient->print(F("X-GH-ID: "));
    m_activeClient->print(GH_ID);
    m_activeClient->print(F("\r\n"));

    char signature[65];
    signPayload(buf, m_payloadLen, signature);
    m_activeClient->print(F("X-Signature: "));
    m_activeClient->print(signature);
    m_activeClient->print(F("\r\n"));

    m_activeClient->print(F("X-Timestamp: "));
    m_activeClient->print((unsigned long)time(nullptr));
    m_activeClient->print(F("\r\n"));
  } else {
    char authBuf[kBearerHeaderBufferLen];
    if (build_auth_header_for_host(authBuf, sizeof(authBuf), m_configManager, host)) {
      m_activeClient->print(F("Authorization: REDACTED
      m_activeClient->print(authBuf);
      m_activeClient->print(F("\r\n"));
    }
  }

  m_activeClient->print(F("\r\n"));  // End of headers

  // Write Body
  m_activeClient->write((const uint8_t*)buf, m_payloadLen);
  releaseSharedBuffer();

  transitionState(HttpState::WAITING_RESPONSE);
}


void ApiClient::handleStateWaiting(unsigned long stateDuration) {
  if (!m_activeClient) {
    updateResult(HTTPC_ERROR_CONNECTION_LOST, false, "Connection Lost");
    transitionState(HttpState::FAILED);
    return;
  }

  if (m_activeClient->available()) {
    transitionState(HttpState::READING_RESPONSE);
  } else {
    // When server closes after sending data, connected() can be false
    // while data is still pending in the buffer. Only treat as lost
    // after confirming no data is available.
    if (!m_activeClient->connected()) {
      updateResult(HTTPC_ERROR_CONNECTION_LOST, false, "Connection Lost");
      transitionState(HttpState::FAILED);
      return;
    }
    if (stateDuration > 10000) {  // 10s timeout
      updateResult(HTTPC_ERROR_READ_TIMEOUT, false, "Timeout");
      transitionState(HttpState::FAILED);
    }
  }
}


void ApiClient::handleStateReading() {
  // Parse Status Line
  char line[128];
  size_t n = m_activeClient->readBytesUntil('\n', line, sizeof(line) - 1);
  line[n] = '\0';
  Utils::trim_inplace(std::span<char>(line));

  const char* p = strchr(line, ' ');
  if (!p) {
    updateResult(-1, false, "Bad Response");
  } else {
    while (*p == ' ')
      ++p;
    if (*p < '0' || *p > '9') {
      updateResult(-1, false, "Bad Response");
    } else {
      int code = 0;
      while (*p >= '0' && *p <= '9') {
        code = (code * 10) + (*p - '0');
        ++p;
      }
      m_lastResult.httpCode = code;
      m_lastResult.success = (code >= 200 && code < 300);

      if (m_lastResult.success) {
        copy_trunc(m_lastResult.message, sizeof(m_lastResult.message), "OK", 2);
      } else {
        char location[64] = {0};
        if (code >= 300 && code < 400) {
          while (m_activeClient->available()) {
            char header[128];
            size_t hn = m_activeClient->readBytesUntil('\n', header, sizeof(header) - 1);
            header[hn] = '\0';
            Utils::trim_inplace(std::span<char>(header));
            if (header[0] == '\0')
              break;
            if (strncmp(header, "Location:", 9) == 0 || strncmp(header, "location:", 9) == 0) {
              const char* value = header + 9;
              while (*value == ' ')
                ++value;
              copy_trunc(location, sizeof(location), value);
              LOG_WARN("API", F("Redirect to: %s"), location);
              break;
            }
          }
        }

        if (location[0] != '\0') {
          char display[24];
          size_t len = strnlen(location, sizeof(display));
          if (len > 20) {
            memcpy(display, location, 17);
            memcpy(display + 17, "...", 3);
            display[20] = '\0';
          } else {
            copy_trunc(display, sizeof(display), location, len);
          }
          m_lastResult.message[0] = '\0';
          size_t pos = 0;
          pos = append_literal(m_lastResult.message, sizeof(m_lastResult.message), pos, "HTTP ");
          pos = append_i32(m_lastResult.message, sizeof(m_lastResult.message), pos, code);
          pos = append_literal(m_lastResult.message, sizeof(m_lastResult.message), pos, "->");
          pos = append_literal(m_lastResult.message, sizeof(m_lastResult.message), pos, display);
        } else {
          m_lastResult.message[0] = '\0';
          size_t pos = 0;
          pos = append_literal(m_lastResult.message, sizeof(m_lastResult.message), pos, "HTTP ");
          pos = append_i32(m_lastResult.message, sizeof(m_lastResult.message), pos, code);
        }
      }
    }
  }

  m_activeClient->stop();
  transitionState(HttpState::COMPLETE);
}


void ApiClient::handleUploadStateMachine() {
  const auto& cfg = m_configManager.getConfig();
  unsigned long stateDuration = millis() - m_stateEntryTime;

