dhimasardinata/esp8266-sensor-node/lib/GreenhouseCommon/ApiClient.Transport.cpp
  switch (m_httpState) {
    case HttpState::IDLE:
      return;
    case HttpState::CONNECTING:
      handleStateConnecting(cfg);
      break;
    case HttpState::SENDING_REQUEST:
      handleStateSending(cfg);
      break;
    case HttpState::WAITING_RESPONSE:
      handleStateWaiting(stateDuration);
      break;
    case HttpState::READING_RESPONSE:
      handleStateReading();
      break;
    default:
      transitionState(HttpState::IDLE);
      break;
  }
}

// =============================================================================
// Main Handle Loop
// =============================================================================


UploadResult ApiClient::performImmediateUpload() {
  UploadResult result = {-1, false, "No data"};
  const AppConfig& cfg = m_configManager.getConfig();
  const uint32_t heapBefore = ESP.getFreeHeap();
  const uint32_t blockBefore = ESP.getMaxFreeBlockSize();
  struct ImmediateHeapTrace {
    uint32_t freeBefore;
    uint32_t blockBefore;
    const UploadResult* resultRef;
    ~ImmediateHeapTrace() {
      LOG_INFO("MEM",
               F("Immediate heap trend: before %u/%u -> after %u/%u (code=%d)"),
               freeBefore,
               blockBefore,
               ESP.getFreeHeap(),
               ESP.getMaxFreeBlockSize(),
               resultRef ? resultRef->httpCode : 0);
    }
  } heapTrace{heapBefore, blockBefore, &result};
  (void)heapTrace;

  LOG_INFO("MEM", F("Immediate upload start heap=%u block=%u"), heapBefore, blockBefore);

  if (m_queuePopRetryAfter != 0 &&
      static_cast<int32_t>(millis() - m_queuePopRetryAfter) < 0) {
    copy_trunc(result.message, sizeof(result.message), "Queue pop cooldown", sizeof("Queue pop cooldown") - 1);
    return result;
  }

  if (m_queuePopFailStreak > 0 && m_loadedRecordSource != UploadRecordSource::NONE) {
    const char* sourceText =
        (m_loadedRecordSource == UploadRecordSource::RTC) ? "RTC"
        : (m_loadedRecordSource == UploadRecordSource::LITTLEFS) ? "LittleFS"
                                                                  : "Unknown";
    if (popLoadedRecord()) {
      m_queuePopFailStreak = 0;
      m_queuePopRetryAfter = 0;
      m_loadedRecordSource = UploadRecordSource::NONE;
      m_cacheSendTimer.setInterval(cfg.CACHE_SEND_INTERVAL_MS);
      m_cacheSendTimer.reset();
      broadcastEncrypted("[QUEUE] Recovery OK (immediate): pop succeeded.");
      copy_trunc(result.message, sizeof(result.message), "Queue pop recovered", sizeof("Queue pop recovered") - 1);
    } else {
      applyQueuePopFailureCooldown(cfg, sourceText);
      copy_trunc(result.message, sizeof(result.message), "Queue pop retry", sizeof("Queue pop retry") - 1);
    }
    return result;
  }

  if (m_wifiManager.isScanBusy()) {
    copy_trunc(result.message, sizeof(result.message), "REDACTED", sizeof("REDACTED") - 1);
    return result;
  }

  // Create a fresh payload
  if (!createAndCachePayload()) {
    copy_trunc(result.message, sizeof(result.message), "Payload creation failed", sizeof("Payload creation failed") - 1);
    return result;
  }
  char* buf = sharedBuffer();
  const size_t buf_len = sharedBufferSize();
  if (!buf || buf_len == 0) {
    copy_trunc(result.message, sizeof(result.message), "No payload buffer", sizeof("No payload buffer") - 1);
    return result;
  }

  size_t record_len = 0;
  UploadRecordLoad loadStatus = loadRecordForUpload(record_len);
  if (loadStatus != UploadRecordLoad::READY || record_len == 0) {
    if (loadStatus == UploadRecordLoad::RETRY) {
      copy_trunc(result.message, sizeof(result.message), "Queue recovery", sizeof("Queue recovery") - 1);
      return result;
    }
    if (loadStatus == UploadRecordLoad::EMPTY) {
      copy_trunc(result.message, sizeof(result.message), "Queue empty", sizeof("Queue empty") - 1);
      return result;
    }
    copy_trunc(result.message, sizeof(result.message), "Queue read failed", sizeof("Queue read failed") - 1);
    return result;
  }

  LOG_INFO("API", F("Immediate upload: %u bytes"), record_len);

  // --- LOGIC REPLICATION FROM handleUploadCycle ---
  bool isTargetEdge = false;
  int gwMode = -1;
  if (m_uploadMode == UploadMode::AUTO) {
    if (m_immediatePollReady) {
      gwMode = m_immediateGatewayMode;
    } else {
      const uint32_t maxBlock = ESP.getMaxFreeBlockSize();
      const uint32_t totalFree = REDACTED
      if (maxBlock >= AppConstants::API_MIN_SAFE_BLOCK_SIZE && totalFree >= AppConstants::API_MIN_TOTAL_HEAP) {
        gwMode = checkGatewayMode();
        LOG_INFO("MODE", F("Immediate gateway poll: %d"), gwMode);
      } else {
        LOG_WARN("MODE",
                 F("Immediate gateway poll skipped (low heap: %u, block %u)"),
                 totalFree,
                 maxBlock);
      }
      m_immediateGatewayMode = static_cast<int8_t>(gwMode);
      m_immediatePollReady = true;
      // Defer cloud upload to the next loop to allow buffers to be freed.
      if (gwMode != 1) {
        m_immediateWarmup = 1;
        m_immediateUploadRequested = true;
        m_httpClient.reset();
        LOG_WARN("MEM", F("Immediate deferred: warmup before HTTPS path (gwMode=%d)"), gwMode);
        result.httpCode = kImmediateDeferred;
        result.success = false;
        copy_trunc(result.message, sizeof(result.message), "Deferred", sizeof("Deferred") - 1);
        return result;
      }
    }
  }

  // Poll Gateway if AUTO
  if (m_uploadMode == UploadMode::AUTO) {
    if (gwMode == 1) {  // 1 = Local
      isTargetEdge = true;
    }
    // If 0 (Cloud) or 2 (Auto) or -1 (Fail), default to Cloud (isTargetEdge = false)
  } else if (m_uploadMode == UploadMode::EDGE) {
    isTargetEdge = true;
  }

  broadcastUploadTarget(isTargetEdge);
  const char* sourceText =
      (m_loadedRecordSource == UploadRecordSource::RTC) ? "RTC"
      : (m_loadedRecordSource == UploadRecordSource::LITTLEFS) ? "LittleFS"
                                                                : "Unknown";

  if (isTargetEdge) {
    // Edge logic: Encrypt and send to Gateway
    {
      char msg[96];
      int n = snprintf(msg, sizeof(msg), "[UPLOAD] Immediate EDGE send from %s (%u B)", sourceText, static_cast<unsigned>(record_len));
      if (n > 0) {
        const size_t len = static_cast<size_t>(std::min<int>(n, static_cast<int>(sizeof(msg) - 1)));
        broadcastEncrypted(std::string_view(msg, len));
      }
    }
    size_t encLen = prepareEdgePayload(record_len);
    if (encLen > 0) {
      if (!m_httpClient) {
        m_httpClient.reset(new (std::nothrow) HTTPClient());
      }
      if (!m_httpClient) {
        result.success = false;
        copy_trunc(result.message, sizeof(result.message), "HTTP alloc fail");
      } else {
        EdgeGatewayTargets edgeTargets = resolveEdgeGatewayTargets();
        const char* candidates[] = {
            edgeTargets.primaryMdns,
            edgeTargets.primaryIp,
            edgeTargets.secondaryMdns,
            edgeTargets.secondaryIp,
        };
        const char* labels[] = {
            "mDNS primary",
            "static primary",
            "mDNS secondary",
            "static secondary",
        };

        for (size_t i = 0; i < (sizeof(candidates) / sizeof(candidates[0])) && !result.success; ++i) {
          const char* candidate = candidates[i];
          if (!candidate || candidate[0] == '\0') {
            continue;
          }

          bool duplicate = false;
          for (size_t j = 0; j < i; ++j) {
            const char* prev = candidates[j];
            if (prev && strcmp(prev, candidate) == 0) {
              duplicate = true;
              break;
            }
          }
          if (duplicate) {
            continue;
          }

          if (i > 0) {
            LOG_WARN("API", F("Immediate EDGE fallback -> %s"), labels[i]);
          }

          char url[96] = {0};
          int urlLen = snprintf(url, sizeof(url), "http://%s/api/data", candidate);
          if (urlLen <= 0 || static_cast<size_t>(urlLen) >= sizeof(url)) {
            continue;
          }

          m_httpClient->setReuse(false);
          if (!m_httpClient->begin(m_plainClient, url)) {
            continue;
          }
          m_httpClient->addHeader("Content-Type", "application/json");

          int code = m_httpClient->POST((uint8_t*)buf, encLen);
          result.httpCode = code;
          result.success = (code >= 200 && code < 300);
          m_httpClient->end();
        }

        if (result.success) {
          copy_trunc(result.message, sizeof(result.message), "OK (Edge)");
        } else {
          copy_trunc(result.message, sizeof(result.message), "Fail (Edge)");
          LOG_WARN("API", F("Immediate EDGE gateways failed; trying cloud"));

