dhimasardinata/esp8266-sensor-node/lib/GreenhouseCommon/ApiClient.Transport.cpp
          size_t cloud_len = 0;
          UploadRecordLoad cloudLoad = loadRecordForUpload(cloud_len);
          if (cloudLoad == UploadRecordLoad::READY && cloud_len > 0) {
            const char* fallbackSourceText =
                (m_loadedRecordSource == UploadRecordSource::RTC) ? "RTC"
                : (m_loadedRecordSource == UploadRecordSource::LITTLEFS) ? "LittleFS"
                                                                          : "Unknown";
            char cloudMsg[104];
            int cn = snprintf(cloudMsg,
                              sizeof(cloudMsg),
                              "[UPLOAD] Immediate HTTPS fallback from %s (%u B)",
                              fallbackSourceText,
                              static_cast<unsigned>(cloud_len));
            if (cn > 0) {
              const size_t len = static_cast<size_t>(std::min<int>(cn, static_cast<int>(sizeof(cloudMsg) - 1)));
              broadcastEncrypted(std::string_view(cloudMsg, len));
            }
            result = performSingleUpload(buf, cloud_len, false);
            if (result.httpCode == HTTPC_ERROR_TOO_LESS_RAM) {
              m_immediateWarmup = 1;
              m_immediateUploadRequested = true;
              m_httpClient.reset();
              LOG_WARN("MEM", F("Immediate deferred: low RAM after EDGE->CLOUD fallback"));
              result.httpCode = kImmediateDeferred;
              result.success = false;
              copy_trunc(result.message, sizeof(result.message), "Deferred", sizeof("Deferred") - 1);
              return result;
            }
          }
        }

        m_httpClient.reset();
      }
    } else {
      result.success = false;
      copy_trunc(result.message, sizeof(result.message), "Encryption failed", sizeof("Encryption failed") - 1);
    }
  } else {
    // Cloud logic (Default)
    {
      char msg[100];
      int n = snprintf(msg, sizeof(msg), "[UPLOAD] Immediate HTTPS send from %s (%u B)", sourceText, static_cast<unsigned>(record_len));
      if (n > 0) {
        const size_t len = static_cast<size_t>(std::min<int>(n, static_cast<int>(sizeof(msg) - 1)));
        broadcastEncrypted(std::string_view(msg, len));
      }
    }
    result = performSingleUpload(buf, record_len, false);
    if (result.httpCode == HTTPC_ERROR_TOO_LESS_RAM) {
      m_immediateWarmup = 1;
      m_immediateUploadRequested = true;
      m_httpClient.reset();
      LOG_WARN("MEM", F("Immediate deferred: low RAM on HTTPS path"));
      result.httpCode = kImmediateDeferred;
      result.success = false;
      copy_trunc(result.message, sizeof(result.message), "Deferred", sizeof("Deferred") - 1);
      return result;
    }
  }

  // Handle result
  if (result.success) {
    if (!popLoadedRecord()) {
      LOG_WARN("UPLOAD", F("Immediate upload success but failed to clear source queue"));
      applyQueuePopFailureCooldown(cfg,
                                   m_loadedRecordSource == UploadRecordSource::RTC ? "RTC"
                                   : m_loadedRecordSource == UploadRecordSource::LITTLEFS ? "LittleFS"
                                                                                            : "Unknown");
    } else {
      if (m_queuePopFailStreak > 0 || m_queuePopRetryAfter != 0) {
        m_cacheSendTimer.setInterval(cfg.CACHE_SEND_INTERVAL_MS);
      }
      m_queuePopFailStreak = 0;
      m_queuePopRetryAfter = 0;
      m_loadedRecordSource = UploadRecordSource::NONE;
    }
    m_lastApiSuccessMillis = millis();
    m_consecutiveUploadFailures = 0;
  } else {
    m_consecutiveUploadFailures++;
  }
  m_immediatePollReady = false;
  m_immediateGatewayMode = -2;

  return result;
}


UploadResult ApiClient::performSingleUpload(const char* payload, size_t length, bool allowInsecure) {
  UploadResult result = {HTTPC_ERROR_CONNECTION_FAILED, false, "Connection Failed"};

  LOG_DEBUG("API", F("--- START UPLOAD ---"));
  LOG_DEBUG("API", F("URL: %s"), m_configManager.getDataUploadUrl());
  LOG_DEBUG("API", F("Length: %u"), length);
  LOG_DEBUG("API", F("Payload Content:\n%s"), payload);
  LOG_DEBUG("API", F("----------------------------"));

  if (!acquireTlsResources(allowInsecure)) {
    copy_trunc(result.message, sizeof(result.message), "Low TLS heap", sizeof("Low TLS heap") - 1);
    m_configManager.releaseStrings();
    return result;
  }

  {
    const uint32_t maxBlock = ESP.getMaxFreeBlockSize();
    const uint32_t totalFree = REDACTED
    uint32_t minBlock = AppConstants::TLS_MIN_SAFE_BLOCK_SIZE;
    uint32_t minTotal = REDACTED
    if (m_ws.count() > 0) {
      minBlock += 512;
      minTotal += REDACTED
    }
    if (maxBlock < minBlock || totalFree < minTotal) {
      copy_trunc(result.message, sizeof(result.message), "Low TLS heap", sizeof("Low TLS heap") - 1);
      result.httpCode = HTTPC_ERROR_TOO_LESS_RAM;
      releaseTlsResources();
      m_configManager.releaseStrings();
      return result;
    }
  }

  if (m_cloudHost[0] == '\0' || m_cloudPath[0] == '\0') {
    updateCloudTargetCache();
  }
  // Free config strings before TLS handshake to maximize available heap.
  m_configManager.releaseStrings();

  const char* host = (m_cloudHost[0] != '\0') ? m_cloudHost : "example.com";
  const char* path = (m_cloudPath[0] != '\0') ? m_cloudPath : "/api/sensor";

  yield();
  LOG_INFO("API", F("TLS pre-connect heap: %u, blk: %u"), ESP.getFreeHeap(), ESP.getMaxFreeBlockSize());
  if (!m_secureClient.connect(host, 443)) {
    copy_trunc(result.message, sizeof(result.message), "TLS connect failed", sizeof("TLS connect failed") - 1);
    releaseTlsResources();
    m_configManager.releaseStrings();
    return result;
  }

  char authBuf[kBearerHeaderBufferLen];
  const bool hasAuthHeader = REDACTED

  m_secureClient.print(F("POST "));
  m_secureClient.print(path);
  m_secureClient.print(F(" HTTP/1.1\r\nHost: "));
  m_secureClient.print(host);
  m_secureClient.print(F("\r\nConnection: close\r\nAccept: application/json\r\nContent-Type: application/json\r\nUser-Agent: ESP8266-Node\r\n"));
  if (hasAuthHeader) {
    m_secureClient.print(F("Authorization: REDACTED
    m_secureClient.print(authBuf);
    m_secureClient.print(F("\r\n"));
  }
  m_secureClient.print(F("Content-Length: "));
  m_secureClient.print(length);
  m_secureClient.print(F("\r\n\r\n"));
  if (length > 0 && payload) {
    m_secureClient.write(reinterpret_cast<const uint8_t*>(payload), length);
  }
  releaseSharedBuffer();

  char line[128];
  if (!read_line(m_secureClient, line, sizeof(line), 5000)) {
    copy_trunc(result.message, sizeof(result.message), "No HTTP response", sizeof("No HTTP response") - 1);
    m_secureClient.stop();
    releaseTlsResources();
    m_configManager.releaseStrings();
    return result;
  }

  result.httpCode = parse_status_code(line);
  result.success = (result.httpCode >= 200 && result.httpCode < 300);

  // Parse headers (Date only)
  char dateBuf[64] = {0};
  while (read_line(m_secureClient, line, sizeof(line), 5000)) {
    if (line[0] == '\0') {
      break;
    }
    if (strncasecmp(line, "Date:", 5) == 0) {
      const char* p = line + 5;
      while (*p == ' ' || *p == '\t')
        ++p;
      copy_trunc(dateBuf, sizeof(dateBuf), p);
    }
  }

  if (dateBuf[0] != '\0' && !m_ntpClient.isTimeSynced()) {
    time_t serverTime = Utils::parse_http_date(dateBuf);
    if (serverTime > 0) {
      m_ntpClient.setManualTime(serverTime);
    }
  }

  buildErrorMessageSimple(result);
  m_secureClient.stop();
  releaseTlsResources();
  m_configManager.releaseStrings();

  return result;
}

// =============================================================================
// handleUploadCycle Helper Methods (Reduce Cyclomatic Complexity)
// =============================================================================

// FIX: Gateway is just a notification - DON'T pop cache!
// Data must reach cloud before removal from cache

